In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {"Name":['Abc','Def','Ghi','Jkl','Mno','Pqr','Stu','Vwx','Yza','Kop','Mah'],
       "Age":[23, 24, 46, 67, 68, 34, 25, 57, 48, 28, 52],
       "Gender":['Male','Female','Male','Male','Female','Male','Female','Male','Male','Male','Female'],
       "Salary":[45000,78000,89000,34000,45000,68000,25000,37000,39000,92000,30000]}

In [3]:
df = pd.DataFrame(data)
df

   Name  Age  Gender  Salary
0   Abc   23    Male   45000
1   Def   24  Female   78000
2   Ghi   46    Male   89000
3   Jkl   67    Male   34000
4   Mno   68  Female   45000
5   Pqr   34    Male   68000
6   Stu   25  Female   25000
7   Vwx   57    Male   37000
8   Yza   48    Male   39000
9   Kop   28    Male   92000
10  Mah   52  Female   30000

### 1) Attributes

In [4]:
df.shape

(11, 4)

In [5]:
df.size

44

In [6]:
df.ndim

2

In [7]:
df.columns

Index(['Name', 'Age', 'Gender', 'Salary'], dtype='object')

In [8]:
df.dtypes

Name      object
Age        int64
Gender    object
Salary     int64
dtype: object

In [9]:
df.axes

[RangeIndex(start=0, stop=11, step=1),
 Index(['Name', 'Age', 'Gender', 'Salary'], dtype='object')]

In [10]:
df.index

RangeIndex(start=0, stop=11, step=1)

In [11]:
df.values

array([['Abc', 23, 'Male', 45000],
       ['Def', 24, 'Female', 78000],
       ['Ghi', 46, 'Male', 89000],
       ['Jkl', 67, 'Male', 34000],
       ['Mno', 68, 'Female', 45000],
       ['Pqr', 34, 'Male', 68000],
       ['Stu', 25, 'Female', 25000],
       ['Vwx', 57, 'Male', 37000],
       ['Yza', 48, 'Male', 39000],
       ['Kop', 28, 'Male', 92000],
       ['Mah', 52, 'Female', 30000]], dtype=object)

In [12]:
df.empty

False

In [13]:
df.T

,0,1,2,3,4,5,6,7,8,9,10
Name,Abc,Def,Ghi,Jkl,Mno,Pqr,Stu,Vwx,Yza,Kop,Mah
Age,23,24,46,67,68,34,25,57,48,28,52
Gender,Male,Female,Male,Male,Female,Male,Female,Male,Male,Male,Female
Salary,45000,78000,89000,34000,45000,68000,25000,37000,39000,92000,30000

### 2) Functions

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    11 non-null     object
 1   Age     11 non-null     int64
 2   Gender  11 non-null     object
 3   Salary  11 non-null     int64
dtypes: int64(2), object(2)
memory usage: 484.0+ bytes

In [15]:
df.head()

  Name  Age  Gender  Salary
0  Abc   23    Male   45000
1  Def   24  Female   78000
2  Ghi   46    Male   89000
3  Jkl   67    Male   34000
4  Mno   68  Female   45000

In [16]:
df.head(7)

  Name  Age  Gender  Salary
0  Abc   23    Male   45000
1  Def   24  Female   78000
2  Ghi   46    Male   89000
3  Jkl   67    Male   34000
4  Mno   68  Female   45000
5  Pqr   34    Male   68000
6  Stu   25  Female   25000

In [17]:
df.tail()   #By default shows 5 values

   Name  Age  Gender  Salary
6   Stu   25  Female   25000
7   Vwx   57    Male   37000
8   Yza   48    Male   39000
9   Kop   28    Male   92000
10  Mah   52  Female   30000

In [18]:
df.describe()

             Age        Salary
count  11.000000     11.000000
mean   42.909091  52909.090909
std    17.037926  24332.918220
min    23.000000  25000.000000
25%    26.500000  35500.000000
50%    46.000000  45000.000000
75%    54.500000  73000.000000
max    68.000000  92000.000000

In [19]:
df["Age"].min()

23

#### Same you can do for:
1. max
2. count
3. mean
4. std

In [20]:
df["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [21]:
df["Gender"].nunique()

2

In [22]:
df["Gender"].value_counts()

Gender
Male      7
Female    4
Name: count, dtype: int64

In [23]:
df.sample()   # Randomly picks a row/record from the dataset

  Name  Age Gender  Salary
3  Jkl   67   Male   34000

In [24]:
df.sample(5)   # Randomly picks 5 rows/record from the dataset

   Name  Age  Gender  Salary
10  Mah   52  Female   30000
9   Kop   28    Male   92000
1   Def   24  Female   78000
7   Vwx   57    Male   37000
3   Jkl   67    Male   34000

### Locate and Ilocate

In [25]:
df.loc[0]    #Provides the details of the specified indexed row

Name        Abc
Age          23
Gender     Male
Salary    45000
Name: 0, dtype: object

In [26]:
df.loc[1:5]    #Slices and provides rows from index 1 to 5

  Name  Age  Gender  Salary
1  Def   24  Female   78000
2  Ghi   46    Male   89000
3  Jkl   67    Male   34000
4  Mno   68  Female   45000
5  Pqr   34    Male   68000

In [27]:
df.iloc[1:5]    #Slices and provides rows from index 1 to 4

  Name  Age  Gender  Salary
1  Def   24  Female   78000
2  Ghi   46    Male   89000
3  Jkl   67    Male   34000
4  Mno   68  Female   45000

In [28]:
df.loc[df['Age'] > 30]    #Provides/selects the rows with age greater than 30

   Name  Age  Gender  Salary
2   Ghi   46    Male   89000
3   Jkl   67    Male   34000
4   Mno   68  Female   45000
5   Pqr   34    Male   68000
7   Vwx   57    Male   37000
8   Yza   48    Male   39000
10  Mah   52  Female   30000

In [29]:
df.loc[(df['Age'] > 20) & (df['Age'] < 30)]    #Same you can apply for salary

  Name  Age  Gender  Salary
0  Abc   23    Male   45000
1  Def   24  Female   78000
6  Stu   25  Female   25000
9  Kop   28    Male   92000

In [30]:
df.iloc[0]

Name        Abc
Age          23
Gender     Male
Salary    45000
Name: 0, dtype: object

In [31]:
df.iloc[-1]     # Negative Indexing / Displays the info of the last row

Name         Mah
Age           52
Gender    Female
Salary     30000
Name: 10, dtype: object

In [32]:
df.iloc[:, 0]     #Displays the column with index 0

0     Abc
1     Def
2     Ghi
3     Jkl
4     Mno
5     Pqr
6     Stu
7     Vwx
8     Yza
9     Kop
10    Mah
Name: Name, dtype: object

In [33]:
df.iloc[0:5]     #Slices the rows from 0 to 5 (indexes from 0 upto 4)

  Name  Age  Gender  Salary
0  Abc   23    Male   45000
1  Def   24  Female   78000
2  Ghi   46    Male   89000
3  Jkl   67    Male   34000
4  Mno   68  Female   45000

In [34]:
df.iloc[:,0:3]     #Slices the columns from 0 to 3 (indexes from 0 upto 2)

   Name  Age  Gender
0   Abc   23    Male
1   Def   24  Female
2   Ghi   46    Male
3   Jkl   67    Male
4   Mno   68  Female
5   Pqr   34    Male
6   Stu   25  Female
7   Vwx   57    Male
8   Yza   48    Male
9   Kop   28    Male
10  Mah   52  Female

In [35]:
df.iloc[1:4, 0:2]    #Displays rows from index 1 to 3 and columns from index 0 to 1

  Name  Age
1  Def   24
2  Ghi   46
3  Jkl   67

In [36]:
df.iloc[[0, 5], [0, 3]]      #Displays rows with index 0 and 5 & columns with index 0 and 3

  Name  Salary
0  Abc   45000
5  Pqr   68000

In [37]:
df.to_excel("Understanding_Data.xlsx")    #Dataframe saved to excel sheet